[
  {
    "id": "eed254ab-8a79-25ff-cb1b-6432aea81650",
    "content": "With all types of sensors, the imaging process begins when light passes through the camera's lens and strikes the sensor. The sensor contains millions of light receptors or photosites, which convert the light energy into an electrical charge. The magnitude of the charge is proportional to the intensity of the light – the more light that hits a particular photosite, the stronger the electrical charge it produces. (SPAD sensors work a little differently – more on this later.)",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "45855f79-4f1c-31b9-e1ac-4c3070778c73",
    "content": "In order to capture colours as well as brightness information, photosites are fitted with red, green and blue colour filters. This means some photosites record the intensity of red light, some the intensity of green, and some the intensity of blue. The electrical signals from all the photosites in the sensor are passed to the camera's image processor, which interprets all this information and determines the colour and brightness values of all the individual pixels (picture elements) that make up a digital image.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "11b8582e-630c-a7c8-03ec-6d43c4656bea",
    "content": "A diagram showing how a camera creates a digital image, with steps including a mosaic colour filter, an image sensor, an analogue-to-digital converter and the image processor. How cameras create a digital image. Light from the subject you're shooting is focused through the lens onto the image sensor (2), which is covered with a mosaic filter (1) to enable it to detect colour and not just light intensity. The electrical signal generated by the sensor may be amplified by analogue electronics (3) before passing through an analogue-to-digital converter (4) to the image processor (5). After processing, the camera may temporarily hold images in a buffer (6) while it writes them to the memory card.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "abffdf63-03c8-e6b5-3851-4de2ede65ff2",
    "content": "If you're shooting RAW, this data is saved, along with information about the camera settings, in a RAW file. If the camera is set to save images in any other file format – JPEG, HEIF or RAW+JPEG – then further processing takes place in-camera, which typically includes white balance adjustment, sharpening and noise reduction, among other processes, depending on the camera settings. It will also include demosaicing or debayering, which cleverly calculates the correct RGB colour value for each pixel (each individual photosite, remember, records only one colour – red, green or blue). The end result is a complete colour digital image – although, in truth, if the image is a JPEG, more of the original information captured by the sensor has been discarded than has been kept.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "9d113540-e673-7e72-e794-d7c334a62862",
    "content": "You conventionally hear about the number of megapixels (millions of pixels) in a sensor, but strictly speaking the sensor does not have pixels at all, but sensels (distinct photosites).",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "4238faa2-3715-2c67-453c-028599fa4fed",
    "content": "The end result is a complete colour digital image – although, in truth, if the image is a JPEG, more of the original information captured by the sensor has been discarded than has been kept. You conventionally hear about the number of megapixels (millions of pixels) in a sensor, but strictly speaking the sensor does not have pixels at all, but sensels (distinct photosites).",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "d8c4fbe0-d664-bc91-810d-32830e8ad7ec",
    "content": "What's more, there is not a one-to-one correspondence between sensels in the sensor and pixels in the resulting digital image, for a whole range of technical reasons. It is more accurate to describe a sensor as having a certain number of 'effective pixels', which simply means that the camera produces images or videos of that number of megapixels.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "59d9e9b8-2dc9-e532-deec-1950f7cda9c2",
    "content": "The Canon PowerShot V10, for example, has a sensor described as approximately 20.9MP in 'total pixels' but some of the sensor data is used for technical processes such as distortion correction and digital image stabilisation, with the result that the PowerShot V10 delivers video (with Movie Digital IS) at approximately 13.1MP and still images (which undergo different processes) at approximately 15.2MP.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "52de060a-32cd-9380-33bc-d6fd91f005de",
    "content": "An illustration of a Bayer array, with alternating rows of red-and-green and blue-and-green colour filters. This is what makes it possible for the sensor to detect colour, not just light intensity. There are more photosites dedicated to green because the human eye happens to be more sensitive to green light than to blue or red.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "c63ab71a-e862-c329-5a0f-f23ad877d807",
    "content": "A 1.0-type CMOS sensor. CMOS sensors of this size are used in compact cameras such as the Canon PowerShot G7 X Mark III and video cameras such as the Canon XF605 professional 4K camcorder.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "ac23747d-766b-5a54-9cff-baa07193e86b",
    "content": "CCD sensors There are several different types of image sensor. Digital photography arrived in the mid-1980s with the introduction of CCD (Charge-Coupled Device) sensors. These sensors were the first to make it possible to capture images without the use of film, revolutionising photography.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "b91bde7c-7bee-1c84-99a7-3bd1a60c20b5",
    "content": "CCD sensors are composed of an integrated grid of semiconductor capacitors capable of holding an electrical charge. When light reaches the sensor, these capacitors, acting as individual photosites, absorb the light and convert it into an electrical charge. The amount of charge at each photosite is directly proportional to the intensity of the light that strikes it.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "d1f7124d-9bc5-4fbe-22db-9a96e2166dc8",
    "content": "In a CCD sensor, the charge from each photosite is transferred through the sensor's grid (hence the term charge-coupled) and read at one corner of the array, in the same way that water might be passed along a bucket brigade or human chain.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "845446b0-9df9-f98d-226b-ff86a6db98a3",
    "content": "What's more, there is not a one-to-one correspondence between sensels in the sensor and pixels in the resulting digital image, for a whole range of technical reasons. It is more accurate to describe a sensor as having a certain number of 'effective pixels', which simply means that the camera produces images or videos of that number of megapixels. The Canon PowerShot V10, for example, has a sensor described as approximately 20.9MP in 'total pixels' but some of the sensor data is used for technical processes such as distortion correction and digital image stabilisation, with the result that the PowerShot V10 delivers video (with Movie Digital IS) at approximately 13.1MP and still images (which undergo different processes) at approximately 15.2MP.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "5a2a7632-669c-c5af-3bae-1b5bef8cbf68",
    "content": "An illustration of a Bayer array, with alternating rows of red-and-green and blue-and-green colour filters. The most common type of colour filter mosaic in digital sensors, a Bayer array. This is what makes it possible for the sensor to detect colour, not just light intensity. There are more photosites dedicated to green because the human eye happens to be more sensitive to green light than to blue or red.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "0e9068e8-768c-0cad-e06f-a49b53bc2daa",
    "content": "A 1.0-type CMOS sensor. A 1.0-type CMOS sensor. CMOS sensors of this size are used in compact cameras such as the Canon PowerShot G7 X Mark III and video cameras such as the Canon XF605 professional 4K camcorder.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "e46599ac-66d4-b17d-14fa-ba3f036a4b4b",
    "content": "CCD sensors. Digital photography arrived in the mid-1980s with the introduction of CCD (Charge-Coupled Device) sensors. These sensors were the first to make it possible to capture images without the use of film, revolutionising photography.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "179b29e8-cd81-a4ff-cc53-970cf23bd050",
    "content": "In a CCD sensor, the charge from each photosite is transferred through the sensor's grid (hence the term charge-coupled) and read at one corner of the array, in the same way that water might be passed along a bucket brigade or human chain. This method ensures a high degree of image quality and uniformity because each pixel uses the same pathway to output its signal.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "e66fe35d-3c05-a98e-a973-af5c1df0eb97",
    "content": "This method ensures a high degree of image quality and uniformity because each pixel uses the same pathway to output its signal. For this reason, Canon's first professional digital camera, the EOS-1D, launched in 2001, had a 4.15MP CCD sensor. However, this process is also more power-intensive than the process in CMOS sensors.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "eb959ed4-a19a-2e35-d80f-c9272bc652aa",
    "content": "CMOS sensors In 2000, Canon introduced its first CMOS (Complementary Metal Oxide Semiconductor) sensor, in the 3.1MP EOS D30. Unlike the CCD sensor, which transfers charges across the sensor to a single output node, a CMOS sensor contains multiple transistors at each photosite, enabling the charge to be processed directly at the site. This has several implications.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "e6d4a4b6-e2ac-2013-8940-ea3d7f404ff6",
    "content": "For a start, CMOS sensors require less power, making them more energy efficient. They can also read off electrical charges at a much faster rate, which is crucial for shooting high-speed sequences. What's more, CMOS sensors share the same basic structure as computer microprocessors, which allows for mass production at a lower cost while incorporating additional functions such as noise reduction and image processing right on the sensor.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "723061e0-0246-a2f7-c1e8-2e3b91777a0f",
    "content": "All of Canon's mirrorless EOS R System cameras feature CMOS sensors, as do the EOS DSLR, Cinema EOS and PowerShot camera ranges.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "e603a0da-dd5d-939a-7105-9ce5b09f8ecc",
    "content": "A cutaway illustration of Canon's Dual Pixel CMOS AF system. In Canon's Dual Pixel CMOS AF system, each photo receptor in the sensor has two separate photodiodes (marked A and B), and comparing the signals from the two determines whether that point is in sharp focus. At the same time, the output (C) from the photo receptor is used for imaging.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "dcaab255-348e-cebd-03fc-cb0da93c553b",
    "content": "A diagram of a sensor with Cross-Type AF points, showing how they are able to detect both vertical lines and horizontal lines. The EOS R1 features a new Dual Pixel CMOS AF sensor arrangement with photodiodes sensitive to phase difference along both the vertical and horizontal axes of the sensor. These Cross Type AF points enable the camera's Dual Pixel Intelligent AF to detect both horizontal and vertical detail, enhancing AF acquisition and tracking performance.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "ce67a736-c1cb-a518-6244-b0534d831192",
    "content": "Developments in CMOS sensors CMOS sensor technology has continued to evolve. An innovation developed by Canon is Dual Pixel CMOS AF technology, which enables each pixel on the sensor to be used for both imaging and autofocus, resulting in faster and more accurate AF performance.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "7ef368c2-633a-2a6c-1c8a-5a07620e7b41",
    "content": "An enhanced version of the system was introduced in 2020: Dual Pixel CMOS AF II. This incorporates EOS intelligent Tracking and Recognition Autofocus (EOS iTR AF X), Canon’s subject detection and tracking system utilising Deep Learning AI.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "8766f657-c18d-0696-7be1-488a2c96ab9e",
    "content": "An innovation developed by Canon is Dual Pixel CMOS AF technology, which enables each pixel on the sensor to be used for both imaging and autofocus, resulting in faster and more accurate AF performance. An enhanced version of the system was introduced in 2020: Dual Pixel CMOS AF II. This incorporates EOS intelligent Tracking and Recognition Autofocus (EOS iTR AF X), Canon’s subject detection and tracking system utilising Deep Learning AI. Dual Pixel CMOS AF II is now widely used across the EOS R System and Cinema EOS lines, delivering greater autofocus speed, precision and coverage in stills and video in cameras such as the EOS R7, EOS R6 Mark II and EOS C400.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "96949dda-1c42-ed59-497c-3b17c55d0af9",
    "content": "Dual Pixel Intelligent AF, which made its debut in 2024 in the EOS R1 and EOS R5 Mark II, has further refined the detection and tracking capabilities, and enabled the introduction of features such as Action Priority AF, which enables the camera to track actions commonly seen in certain sports and automatically shift the focus to the area where the action is taking place.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "713444c6-c219-0910-11d0-b3f998e5bc21",
    "content": "In the EOS R1, the autofocus is advanced still further with Cross Type AF, enabling the sensor to detect phase difference not just vertically, like other AF systems, but also horizontally at the same time. This enhanced sensitivity results in increased focusing accuracy and speed in low-light and low-contrast situations, and even more stable AF performance in continuous shooting mode.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "b7cf26bd-453b-c097-4dfe-7b637c377d48",
    "content": "An illustration of the stacked, back-illuminated CMOS sensor in the Canon EOS R3. The stacked, back-illuminated CMOS sensor in the Canon EOS R3 is designed for capturing high-speed and high-resolution imagery.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "660dd1b1-2c05-81cd-0479-4a9cc40eb8bd",
    "content": "A Canon EOS C400 camera with no lens attached, revealing the sensor. The fast readout of the Back-Side Illuminated (BSI) sensor in the EOS C80 and EOS C400 (shown here) minimises distortion when filming moving objects or when the camera is panned quickly.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "4751480f-6d79-fdb4-3415-1c647ed6590c",
    "content": "Another development in Canon's CMOS technology is the stacked, back-illuminated sensor design used in the EOS R1, EOS R5 Mark II and EOS R3. This design places the photodiodes above the transistor layer to improve light collection efficiency, resulting in less image noise and better image quality. Additionally, the stacked structure allows faster data readout, contributing to the camera's high-speed performance.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "530904d0-0886-e426-ca6b-9d28338326b0",
    "content": "Both the EOS R1 and EOS R5 Mark II are also equipped with a DIGIC Accelerator, which boosts the volume of data that the camera is capable of processing. In combination with the high-speed back-illuminated stacked sensor, the DIGIC Accelerator unlocks a host of features, including faster electronic shutter speeds, simultaneous recording of stills and video, and a significant reduction in rolling shutter distortion compared to earlier cameras.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "a8e552e3-28fb-c408-7b5d-8cc3ac42f371",
    "content": "Similar sensor technology is also deployed in selected Cinema EOS cameras. The EOS C80 and EOS C400 incorporate 6K full-frame Back-Side Illuminated (BSI) CMOS sensors, which provide improved low-light performance compared to front-illuminated sensors. As well as delivering 16 stops of dynamic range and minimal noise, the BSI sensor’s fast readout speeds minimise rolling shutter distortion.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "3bee73f4-5ffe-2223-ac45-7097865c8173",
    "content": "The Canon ME20F-SH camera with a 50mm EF lens. The Canon ME20F-SH multi-purpose camera can see and shoot in almost complete darkness.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "518b847e-5ba0-69f1-c401-13ee7c74b59c",
    "content": "The full-frame image sensor from the Canon ME20F-SH ultra-low-light camera. The camera's specially developed full-frame CMOS sensor is designed specifically for low light video capture. With larger photo receptors, it maximises light-gathering capabilities to deliver ultra-low-light images with low noise.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "a75bb69d-2d39-d03d-a314-66e031fb2e0c",
    "content": "Canon's CMOS sensor research and development is ongoing. One result of this is an ultra high sensitivity 35mm full-frame CMOS sensor, with much larger photo receptors (approximately 7.5 times the size of those in previous sensors). Larger photo receptors are able to capture more light, in this case achieving a sensitivity equivalent to ISO 4 million, enabling a camera to capture vivid colour images of very dark environments. This technology is used in the Canon ME20F-SH ultra low light video camera.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "1ad1661d-5d13-46ca-9597-c4cc58e31fa4",
    "content": "Canon has also developed an ultra high pixel count sensor, using advanced miniaturisation techniques to reduce the photosite size. This facilitates very high resolution image capture, with a pixel count up to 250MP. In an image captured using this technology, it is possible to distinguish the lettering on an aircraft in flight 18km away and achieve a resolution approximately 30 times higher than that of 4K video. This has great potential for applications in surveillance, astronomical observation and medical imaging.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "278f3064-0ce2-c65e-d5a9-74353d121555",
    "content": "One shortcoming of current CMOS sensors is that, for technical reasons including data bandwidth, their data is read out sequentially rather than all at once. This results in issues such as \"rolling shutter\" distortion of fast-moving subjects that have changed their position during the time the frame is being read out. However, the advanced back-illuminated stacked CMOS sensor design used in cameras such as the EOS R1 and EOS R5 Mark II enables much faster readout speeds, greatly alleviating this issue.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "4304e48d-f7de-5262-f492-4c83fded37dd",
    "content": "This results in issues such as 'rolling shutter' distortion of fast-moving subjects that have changed their position during the time the frame is being read out. However, the advanced back-illuminated stacked CMOS sensor design used in cameras such as the EOS R1 and EOS R5 Mark II enables much faster readout speeds, greatly alleviating this issue. Indeed, it is almost completely eliminated in the EOS R1, which boasts a 40% reduction in rolling shutter over the already fast-readout CMOS sensor in the EOS R3.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "681b14e5-b4a8-29e7-ef14-2f34d71eaabd",
    "content": "Canon is actively investigating other solutions such as 'global shutter' technology, which enables readout of the entire sensor in one go, but this technology is very complex, adds both image noise and cost, and can't yet produce very high-quality outputs.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "2910161a-4fa8-ce87-4a3d-505f0edc8fde",
    "content": "A diagram of Canon's Dual Gain Output sensor technology, showing the same image read at two amplification levels and then combined into a single image.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "af0c60a2-62cf-f35c-c1ba-49a8adf9a43d",
    "content": "The key to Canon's Dual Gain Output (DGO) technology is that each photosite on the sensor is read at two amplification levels, one high-gain and one low, and the two readouts are then combined into a single HDR image with astonishing detail and low noise.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "62afc3af-0286-dad7-fa4a-4b11ffaf5838",
    "content": "The DGO (Dual Gain Output) sensor is an advanced image sensor used in the Canon EOS C300 Mark III and EOS C70 professional video cameras.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "6f745cf3-7de0-b19a-5179-e6604772888c",
    "content": "Canon’s DGO sensor works by reading each pixel at two different amplification levels, one high and one low, and then combining these two readouts into a single image. The high amplification readout is optimised to capture fine details in shadow regions while reducing noise. The low amplification readout is designed to maintain and accurately reproduce information in the highlights. Combining these produces an image that has a broader dynamic range, retains more detail and exhibits less noise compared to images from conventional sensor technologies.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "ef3f3941-7888-c40f-e3e4-d879daaf2061",
    "content": "The DGO technology does not consume any more power than a conventional sensor, and is also compatible with Canon's Dual Pixel CMOS AF system and electronic image stabilisation, delivering fast, reliable autofocus and a super-steady image.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "c3dca034-1103-7115-22c9-1cce5c5ac848",
    "content": "A diagram comparing the operation of a CMOS sensor with that of a SPAD sensor.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "901912ec-01fe-152d-4eb7-23618ba81037",
    "content": "Both a CMOS sensor (A) and a SPAD sensor (B) include p -type semiconductors (2) and n -type semiconductors (3) but in different configurations. When a single photon (1) strikes either type of sensor, a single electron is generated (4). In a CMOS sensor, the charge of a single electron is too small to be detected as an electrical signal, so the charge has to be accumulated over a certain period of time.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "6b77dfee-f055-7427-c4cb-fd2ec7e7fee0",
    "content": "When a single photon (1) strikes either type of sensor, a single electron is generated (4). In a CMOS sensor, the charge of a single electron is too small to be detected as an electrical signal, so the charge has to be accumulated over a certain period of time. By contrast, a SPAD sensor amplifies the charge by approximately one million times using a phenomenon called Avalanche Multiplication (5), which causes a large current to flow instantaneously, enabling the sensor to detect that a single photon has hit it.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "c3ca2260-45eb-eee1-15b9-d2c3770c9147",
    "content": "The Canon SPAD sensor CCD and CMOS sensors measure the intensity of light – in other words, how many photons reach the sensor within a specified time. SPAD (Single Photon Avalanche Diode) sensors work differently, using the \"avalanche\" effect in semiconductors. When a photon strikes the sensor, it generates an electron, which then triggers a chain reaction or \"avalanche\" of electron production. This cascading effect causes a large current to flow instantaneously, which is read out as a voltage signal in the form of a train of pulses corresponding to individual photons.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "e858c32e-51d4-1c1c-5be4-fcfaf19d0b92",
    "content": "This unique light-sensing technology means SPAD sensors can achieve incredible low-light performance. Using the outstanding SPAD sensor, Canon has developed the MS-500, a breakthrough interchangeable-lens camera capable of capturing high-definition colour footage in extremely low-light conditions, even the near-total darkness of a night-time environment.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "4aec7a57-e901-363a-8c98-9a01c90f1e4b",
    "content": "In addition, the MS-500's bayonet mount for a 2/3-inch broadcast lens enables the camera to utilise Canon's extensive range of broadcast lenses, with their excellent super-telephoto optical performance. This means the camera is able to resolve subjects several kilometres away, even if they are unlit, making it an invaluable asset for security, surveillance and a broad range of scientific applications.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "efec7573-1dbd-1a8f-3b3d-4c70a47fc26c",
    "content": "CINC_Product_H264 Sensor sizes explained It's clear that a sensor's megapixel count (whether it's total or effective pixels) isn't the whole story. The physical size of the sensor is an important factor. APS-C sensors are physically smaller than full-frame sensors, which means that even if the pixel counts are identical, a camera with a full-frame sensor should deliver a wider dynamic range and better low-light performance – if it has the same megapixel count but over a larger area, then it has larger photosites, which will be capable of capturing more light.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "d907627f-2107-2bf5-f335-b3e48dcbc4c5",
    "content": "This makes full-frame cameras such as the EOS R1 and EOS R5 Mark II a favourite choice for professionals, particularly those shooting landscapes, architecture or portraits. Conversely, because APS-C sensors are smaller, your subject will fill more of the frame than it would if you used the same lens with the same settings on a full-frame camera – so in effect, an APS-C sensor increases the reach of your lens.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "29a18f61-1660-ad5f-cd62-86547863c513",
    "content": "Conversely, because APS-C sensors are smaller, your subject will fill more of the frame than it would if you used the same lens with the same settings on a full-frame camera – so in effect, an APS-C sensor increases the reach of your lens. In Canon cameras, the \"crop factor\" is approximately 1.6x, giving you an effective focal length 1.6x greater than the same lens on a full-frame camera. This gives a 50mm lens, for example, the field of view of an 80mm lens (50 x 1.6 = 80). This means APS-C cameras are well suited for a broad range of uses including wildlife and street photography. In addition, thanks to the smaller sensor, APS-C cameras such as the EOS R50 and EOS R10 are smaller and lighter than their full-frame counterparts, making them a great option for travel or nature shoots.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "0b49327b-317b-6cc5-116c-3ba322217417",
    "content": "Some video cameras use Super 35mm sensors (active area approximately 24.6 x 13.8mm, depending on the resolution setting), which are slightly larger than APS-C (22.2 x 14.8mm) but still less than half the area of full-frame (36 x 24mm). They are widely used in the film industry thanks to their balance between cost, image quality and cinematic look (with a shallow depth of field). Camcorders and other camera types use a range of other sensor sizes, such as the 20.1MP 1.0-type stacked CMOS sensor in the compact PowerShot G7 X Mark III and the 11.7MP 1/2.3 CMOS sensor in the PowerShot PX.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "c57907fe-0c5b-4661-b8e7-aca81b0492cd",
    "content": "An APS-C sensor in front of a full-frame sensor, showing their relative sizes. CMOS sensors come in different sizes. A full-frame sensor has approximately 1.6x the active surface area of an APS-C sensor.",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "9fd2fe4c-ae77-7585-5d1d-ef4b300fa555",
    "content": "A diagram showing a \"light bucket\" containing yellow photons and grey noise, alongside a larger one with more yellow photons. If two sensors have the same total pixel count but one is physically larger than the other, then each photosite on the larger one must be bigger. This is sometimes included in camera specs as the \"pixel pitch\" – a 21MP APS-C camera might have a pixel pitch of about 4.22 microns while a 21MP full-frame camera might be 6.45 microns. Photosites act as \"light buckets\" and, in the same way that a wider bucket would capture more rainwater than a narrower bucket, a larger photosite captures more photons (shown in yellow) with relatively less random noise (grey).",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  },
  {
    "id": "0ddd5f68-cc63-48b3-5bf4-20f4337a927d",
    "content": "The choice of sensor size depends largely on your shooting requirements and budget. Each sensor size offers distinct advantages, and understanding these can help you select the right camera for your specific needs. However, you can see why standardising on \"effective pixels\" provides a simpler measure for comparing different cameras and different technologies!",
    "source_id": "5a0ca4ce637bfb979075fb12411e466674837a6bd4bffdb4d8b1b21f5460e823"
  }
]